{
    "0": {
      "id": 0,
      "code": "0000",
      "name": "청견",
      "image": "@/assets/images/lovetype/Kiyomi.png",
      "traits": {
        "role": "Follow",
        "affection": "Cuddly",
        "mindset": "Passionate",
        "attitude": "Earnest"
      },
      "personality": "겉으로는 단정하고 차분해 보이지만 내면에는 순수함과 따뜻함을 지녔습니다. 성실하고 책임감이 강해 신뢰를 얻으며, 가끔 보여주는 서툰 모습이 오히려 '숨겨진 귀여움'으로 다가와 주변의 사랑을 받습니다. 조용하지만 확실하게 주변에 좋은 영향을 주는 존재입니다.",
      "style": "한결같고 성실한 사랑을 하며 상대에게 헌신하는 타입입니다. 순수한 만큼 상처받기 쉽고 상대에게 맞추려는 경향이 강해 감정 소모를 겪기도 하지만, 연애를 통해 안정과 행복을 느끼며 함께하는 시간을 무엇보다 소중히 여깁니다.",
      "ideal": "자신의 순수함을 이해하고 감정을 있는 그대로 공유할 수 있는 사람을 선호합니다. 부족한 점을 채워주며 함께 성장할 수 있는 상대, 섬세한 감정을 나누며 곁을 지켜주는 사람에게 안정감을 느낍니다.",
      "best": "자몽 - 당신의 강아지 같은 모습에 상대는 마음을 열고, 당신은 즐겁게 사랑을 표현하는 최고의 균형입니다.",
      "good": "레몬 - 활발한 에너지가 잘 맞습니다. 상대의 페이스를 따르는 당신에게 레몬은 매력을 느낍니다.\n\n낑깡 - 당신의 순수함이 낑깡의 마음을 움직입니다. 서로 칭찬하고 따르며 깊은 관계로 발전합니다.",
      "challenge": "다른 유형과 뚜렷한 상극은 없어 특별히 어려운 유형은 아닙니다. 서로 페이스만 맞춘다면 큰 문제 없이 지낼 수 있습니다."
    },
    "1": {
      "id": 1,
      "code": "0001",
      "name": "오렌지",
      "image": "@/assets/images/lovetype/Orange.png",
      "traits": {
        "role": "Follow",
        "affection": "Cuddly",
        "mindset": "Passionate",
        "attitude": "Optimistic"
      },
      "personality": "자유분방하고 예측 불가능한 매력을 지녔으며, 독립심과 모험심이 강해 늘 새로운 경험을 추구합니다. 자기중심적으로 보일 때도 있지만, 기쁨과 슬픔을 솔직하게 드러내는 진정성이 있어 사람들에게 강한 인상을 남깁니다.",
      "style": "구속을 싫어하고 자신만의 자유로운 방식으로 사랑을 합니다. 금방 사랑에 빠지지만 식기도 쉬운 편이며, 상대에게 맞추기보다 자신의 페이스를 유지합니다. 연애를 통해 새로운 경험을 하고 스스로 성장하기를 원합니다.",
      "ideal": "자신의 자유와 독립성을 존중해주며 새로운 모험을 함께 즐길 수 있는 사람이 이상적입니다. 솔직한 감정 표현을 부담 없이 받아주고 섬세하게 공감해 주는 상대와 있을 때 안정감을 느낍니다.",
      "best": "진지향 - 알 수 없는 매력의 진지향에게 금방 반하며, 서로의 매력을 알아보면 불꽃이 튀는 궁합입니다.",
      "good": "황금향 - 당신의 자유로움을 황금향이 관용으로 받아주어 완벽한 균형을 이룹니다.",
      "challenge": "포멜로 - 둘 다 감정 기복이 커서 충돌이 잦습니다. 상대의 진심이 당신을 움직일지가 관건입니다.\n\n감귤 - 감정 기복으로 인해 충돌하기 쉽습니다. 상대가 당신을 사랑해서 참는 관계가 될 수 있습니다."
    },
    "2": {
      "id": 2,
      "code": "0010",
      "name": "레드향",
      "image": "@/assets/images/lovetype/Kanpei.png",
      "traits": {
        "role": "Follow",
        "affection": "Cuddly",
        "mindset": "Realistic",
        "attitude": "Earnest"
      },
      "personality": "부드러운 외모 속에 냉철한 현실 감각과 강렬한 매력을 숨기고 있습니다. 전체를 보는 통찰력이 뛰어나며, 신뢰하는 사람에게는 깊은 감정을 표현합니다. 평소에는 상냥하지만 중요한 순간에는 흔들리지 않는 단단함과 냉정함을 보여줍니다.",
      "style": "자신을 행복하게 해 줄 사람을 알아보는 선구안이 있으며, 한 번 사랑하면 깊고 진하게 헌신합니다. 하지만 맹목적이지 않고 이성적인 '브레이크'를 가지고 있어, 감정에 휩쓸리지 않고 관계의 균형을 잘 유지합니다.",
      "ideal": "자신만의 세계가 뚜렷하고 활기찬 분위기를 가진 사람에게 끌립니다. 당신의 차분함과 상대의 활기가 조화를 이루며, 감정에만 치우치지 않고 서로의 행복을 존중하는 균형 잡힌 관계를 선호합니다.",
      "best": "황금향 - 당신의 친화력을 황금향이 받아주며, 비슷한 가치관으로 평온한 관계를 유지합니다.",
      "good": "레몬 - 레몬의 에너지에 끌리며, 당신의 침착함을 상대가 이해해주어 적절한 온도의 관계가 됩니다.\n\n레드향 - 가치관이 일치하여 서로 성장시키며 함께 나아가는 파트너가 됩니다.",
      "challenge": "블러드 오렌지 - 무의식적으로 마음을 흔드는 상대라 다루기 어렵습니다. 당신이 먼저 반한다면 가능성은 있습니다."
    },
    "3": {
      "id": 3,
      "code": "0011",
      "name": "카라향",
      "image": "@/assets/images/lovetype/Kara.png",
      "traits": {
        "role": "Follow",
        "affection": "Cuddly",
        "mindset": "Realistic",
        "attitude": "Optimistic"
      },
      "personality": "사람을 매료시키는 재주가 뛰어나고 상황 판단이 빠릅니다. 자신의 매력을 잘 알고 활용하지만, 정작 깊은 속마음이나 감정을 솔직하게 드러내는 것은 어려워하여 군중 속의 고독을 느끼기도 합니다.",
      "style": "상대를 매료시키는 데 능숙하며 관계에서 늘 새로운 자극을 추구합니다. 구속받는 것을 싫어해 서로의 자유를 존중하는 연애를 선호하지만, 내면의 외로움을 이해해 줄 상대를 기다립니다. 연애를 통해 성숙해지고자 합니다.",
      "ideal": "자유로운 성향을 억누르지 않고 고유의 매력을 인정해 주는 사람을 찾습니다. 함께 새로운 것을 배우며 성장할 수 있고, 겉모습 뒤에 숨겨진 깊은 감정까지 섬세하게 공감해 주는 상대가 이상적입니다.",
      "best": "유자 - 당신의 안목으로 유자의 진가를 알아봅니다. 유자의 성실함이 당신에게 긍정적인 영향을 줍니다.",
      "good": "진지향 - 예측 불가능한 매력에 끌리며, 서로의 자유를 존중하고 신선한 관계를 유지합니다.",
      "challenge": "천혜향 - 둘 다 자신을 사랑하는 타입이라 기싸움이 될 수 있습니다. 한쪽이 져주거나 연애 고수여야 가능합니다."
    },
    "4": {
      "id": 4,
      "code": "0100",
      "name": "감귤",
      "image": "@/assets/images/lovetype/Mandarin.png",
      "traits": {
        "role": "Follow",
        "affection": "Accept",
        "mindset": "Passionate",
        "attitude": "Earnest"
      },
      "personality": "온화하고 소박해 보이지만, 내 사람은 확실히 챙기는 헌신적인 타입입니다. 감정 표현이 솔직하고 투명하며, 안정적인 관계에서 편안함을 느낍니다. 의존적인 면이 있어 가까운 사람에게서 안정을 얻습니다.",
      "style": "한결같고 성실하게 사랑하며 관계를 지키기 위해 노력합니다. 상대에게 맞추려는 경향이 커서 휘둘리기도 하고 상처도 잘 받지만, 계산 없이 진심을 다하는 따뜻한 애정 표현이 가장 큰 매력입니다.",
      "ideal": "순수함을 이해하고 한결같이 곁을 지켜주는 사람에게 안정감을 느낍니다. 감정의 기복을 함께 나누고 공감해 주며, 부족한 부분을 채워주고 이끌어주는 리더십 있는 상대와 잘 맞습니다.",
      "best": "레몬 - 레몬이 이끌고 당신이 지지하는, 서로의 부족함을 완벽히 채워주는 최고의 커플입니다.",
      "good": "자몽 - 당신의 다정함이 자몽에게는 장점이 되며, 자몽의 덤덤함에 당신은 안심을 느낍니다.\n\n진지향 - 진지향의 다면적인 모습이 당신에게 즐거운 자극이 되며, 독특한 페이스를 이해해 주는 관계입니다.",
      "challenge": "오렌지 - 둘 다 감정 기복이 커서 충돌이 잦습니다. 당신이 상대를 너무 사랑해서 참는 관계가 될 수 있습니다."
    },
    "5": {
      "id": 5,
      "code": "0101",
      "name": "블러드오렌지",
      "image": "@/assets/images/lovetype/Blood.png",
      "traits": {
        "role": "Follow",
        "affection": "Accept",
        "mindset": "Passionate",
        "attitude": "Optimistic"
      },
      "personality": "부드러운 겉모습 속에 강렬하고 신비로운 내면을 품고 있습니다. 호기심이 많고 독립적이며, 혼자만의 시간을 중요시합니다. 감정 표현은 솔직하고 진하며, 가볍지 않은 깊이 있는 분위기를 지녔습니다.",
      "style": "연애에서도 자신만의 색깔과 자유를 잃지 않으려 합니다. 새로운 자극에 민감해 금방 사랑에 빠지기도, 식기도 합니다. 상대에게 완전히 맞추기보다 연애를 통해 감정을 배우고 자신을 성장시키는 과정을 중요하게 여깁니다.",
      "ideal": "겉과 속이 다른 다채로운 매력과 독립성을 있는 그대로 받아주는 사람이 필요합니다. 새로운 경험을 함께 즐길 수 있고, 진한 감정 표현을 깊이 있게 공감해 주는 섬세한 상대에게 끌립니다.",
      "best": "천혜향 - 처음엔 맞춰주다가 의외로 코드가 잘 맞아 서로에게 없어서는 안 될 존재가 됩니다.",
      "good": "자몽 - 서로 마이페이스라 싸움 없이 온화하게 잘 지내는, 이해하기 쉬운 관계입니다.",
      "challenge": "레드향 - 무의식적으로 마음을 흔드는 상대라 다루기 어렵습니다. 당신이 먼저 반한다면 가능성은 있습니다."
    },
    "6": {
      "id": 6,
      "code": "0110",
      "name": "라임",
      "image": "@/assets/images/lovetype/Lime.png",
      "traits": {
        "role": "Follow",
        "affection": "Accept",
        "mindset": "Realistic",
        "attitude": "Earnest"
      },
      "personality": "작지만 또렷한 존재감과 강한 책임감을 가졌습니다. 상황 파악이 빠르고 완벽주의 성향이 있어 신뢰를 받지만, 스스로를 몰아붙이기도 합니다. 차분해 보이지만 기쁨과 슬픔을 솔직하게 표현하는 반전 매력이 있습니다.",
      "style": "좋아하는 사람을 위해 최선을 다하며 관계의 발전을 위해 노력합니다. 자신만의 기준이 있어 상대에게 모든 것을 맞추지는 않지만, 사랑을 통해 서로 성장하고 더 나은 사람이 되기를 꿈꾸는 진지한 연애를 합니다.",
      "ideal": "자신의 능력과 노력을 인정해주고, 완벽주의적인 성향을 이해해 주는 사람에게 끌립니다. 미래를 함께 계획하고 실천할 수 있는 현실적인 파트너, 감정을 가볍게 여기지 않고 진심으로 공유할 수 있는 사람이 이상적입니다.",
      "best": "낑깡 - 낑깡의 숨겨진 어리광과 진심을 꿰뚫어 보며, 제멋대로인 요구도 완벽하게 받아주는 찰떡궁합입니다.",
      "good": "천혜향 - 장난기 많은 천혜향을 능숙하게 다루며, 서로에게 없는 매력에 끌려 애정을 주고받습니다.",
      "challenge": "유자 - 둘 다 상대를 잘 다루는 타입이라 나쁘진 않지만, 불꽃이 튀는 열정적인 관계는 되기 어렵습니다."
    },
    "7": {
      "id": 7,
      "code": "0111",
      "name": "한라봉",
      "image": "@/assets/images/lovetype/Dekopon.png",
      "traits": {
        "role": "Follow",
        "affection": "Accept",
        "mindset": "Realistic",
        "attitude": "Optimistic"
      },
      "personality": "강한 존재감과 독특한 개성, 예측할 수 없는 매력을 지녔습니다. 호기심이 많고 상황에 따라 감정과 에너지가 크게 변하는 자유로운 영혼입니다. 독립적이지만 감정 표현만큼은 솔직하고 풍부합니다.",
      "style": "관습에 얽매이지 않고 자신만의 방식으로 사랑합니다. 감정의 기복이 있어 관계가 깊어지기 어렵기도 하지만, 억지로 자신을 바꾸려 하지 않습니다. 연애를 통해 다양한 감정을 맛보며 넓은 세계로 성장하고자 합니다.",
      "ideal": "자유분방함과 독특한 개성을 억누르지 않고 존중해 주는 사람이 맞습니다. 함께 낯선 곳을 탐험하며 새로운 자극을 즐길 수 있고, 풍부한 감정 변화를 예민하게 캐치하여 공감해 주는 상대에게 마음을 엽니다.",
      "best": "포멜로 - 포멜로의 서투름과 당신의 느긋함이 절묘하게 어울려, 서로 자연스러운 모습을 드러낼 수 있습니다.",
      "good": "특별히 강한 끌림은 없지만, 누구와도 무리 없이 편안하게 지낼 수 있는 타입입니다.",
      "challenge": "황금향 - 둘 다 너무 신중하고 독립적이라 관계가 시작조차 되기 어렵습니다. 만난다면 독립적인 관계가 됩니다."
    },
    "8": {
      "id": 8,
      "code": "1000",
      "name": "포멜로",
      "image": "@/assets/images/lovetype/Pomelo.png",
      "traits": {
        "role": "Lead",
        "affection": "Cuddly",
        "mindset": "Passionate",
        "attitude": "Earnest"
      },
      "personality": "겉은 크고 단단해 보이지만 속은 정이 많고 따뜻한 의리파입니다. 제멋대로인 듯 활기차 보이지만, 사실은 섬세하고 여린 마음을 가진 '츤데레' 같은 매력이 있어 미워할 수 없는 사람입니다.",
      "style": "한 번 마음을 주면 끝까지 사랑하는 의리 있는 연애를 합니다. 겉모습과 달리 속마음은 여려서 상처를 잘 받기도 하지만, 사랑을 포기하지 않는 순수함을 지녔습니다. 마음을 놓을 수 있는 상대에게 깊은 애정을 쏟습니다.",
      "ideal": "서투른 감정 표현과 제멋대로인 모습 뒤에 숨겨진 진심을 따뜻하게 받아주는 사람이 필요합니다. 상대를 시험하려는 태도나 감정 기복까지도 너그럽게 이해해 주며, 속마음을 편안하게 열도록 도와주는 상대가 이상적입니다.",
      "best": "한라봉 - 당신의 서투름과 한라봉의 느긋함이 잘 맞아, 서로 본연의 모습을 자연스럽게 드러냅니다.",
      "good": "황금향 - 당신의 서툰 면을 모두 이해해 줍니다. 비슷하면서도 신비로운 서로의 매력에 끌립니다.\n\n포멜로 - 순수함끼리 부딪혀 싸움도 잦지만, 서로를 배려하는 마음도 두 배라 깊은 관계가 됩니다.",
      "challenge": "오렌지 - 둘 다 감정 기복이 커서 충돌합니다. 당신의 진심이 상대를 움직일 수 있을지가 관건입니다."
    },
    "9": {
      "id": 9,
      "code": "1001",
      "name": "천혜향",
      "image": "@/assets/images/lovetype/Setoka.png",
      "traits": {
        "role": "Lead",
        "affection": "Cuddly",
        "mindset": "Passionate",
        "attitude": "Optimistic"
      },
      "personality": "어디서든 분위기를 주도하는 밝고 싱그러운 에너지의 소유자입니다. 활기찬 모습과 조용히 빛나는 모습이 공존하며, 겉으로는 늘 안정적이고 밝아 보이지만 속으로는 남에게 보이기 싫은 섬세한 고민을 품고 있습니다.",
      "style": "인기가 많고 마음이 움직이는 속도가 빨라 변화가 잦은 편입니다. 하지만 사랑에 빠지면 소년·소녀처럼 순수하게 몰입하며 진심을 다합니다. 시간이 지날수록 마음의 방향이 뚜렷해져 결국엔 안정적인 사랑에 정착합니다.",
      "ideal": "직감적으로 끌리는 사람, '좋아하게 된 사람'이 곧 이상형입니다. 이성적인 조건보다 자신의 감성과 느낌을 믿고 연애하는 것이 잘 맞습니다. 당신의 감정을 활력으로 바꿔주는, 함께 있으면 생기가 도는 관계를 선호합니다.",
      "best": "블러드 오렌지 - 처음엔 상대가 맞춰주다가 의외로 코드가 잘 맞아, 서로에게 없어서는 안 될 존재가 됩니다.",
      "good": "라임 - 장난기 많은 당신을 라임이 능숙하게 받아주며, 서로 사랑을 주고받는 훈훈한 관계입니다.\n\n유자 - 당신에게 잘 맞춰주면서도 휘둘리지 않는 유자의 강력한 안정감에 기분이 좋아집니다.",
      "challenge": "카라향 - 둘 다 자신을 사랑하는 타입이라 기싸움이 될 수 있습니다. 한쪽이 져주거나 연애 고수여야 가능합니다."
    },
    "10": {
      "id": 10,
      "code": "1010",
      "name": "낑깡",
      "image": "@/assets/images/lovetype/Kumquat.png",
      "traits": {
        "role": "Lead",
        "affection": "Cuddly",
        "mindset": "Realistic",
        "attitude": "Earnest"
      },
      "personality": "작고 소박해 보이지만 속은 단단하고 알찹니다. 성실하고 책임감이 강해 존경받으며, 가끔 보여주는 장난기 어린 순수한 모습이 매력 포인트입니다. 서툰 부분도 있지만 노력하는 모습이 사랑스러운 사람입니다.",
      "style": "겉으로는 주도적이고 단단해 보이지만, 마음을 연 사람에게는 한없이 어리광을 부리고 싶어 합니다. 진지한 연애를 선호하며, 시간이 지날수록 깊은 진심을 보여주는 '볼매' 스타일의 연애를 합니다.",
      "ideal": "자존심을 지켜주면서도 숨겨진 어리광을 자연스럽게 받아주는 사람이 최고입니다. 겉모습 뒤에 있는 의존하고 싶은 마음을 알아채고 감싸줄 수 있는, 정신적으로 조금 더 성숙하거나 포용력 있는 상대를 만났을 때 편안함을 느낍니다.",
      "best": "라임 - 당신의 숨겨진 진심과 어리광을 꿰뚫어 보고, 제멋대로인 요구도 완벽하게 받아줍니다.",
      "good": "낑깡 - 서로를 잘 이해하며 어린아이 같은 모습을 이끌어냅니다. 본연의 모습으로 있을 수 있어 편안합니다.\n\n청견 - 청견의 순수함이 마음을 움직입니다. 당신을 따르는 상대에게 마음을 열고 깊어집니다.",
      "challenge": "진지향 - 성실한 당신에게 속을 알 수 없는 진지향은 어렵고, 기가 세서 부딪히기 쉽습니다."
    },
    "11": {
      "id": 11,
      "code": "1011",
      "name": "자몽",
      "image": "@/assets/images/lovetype/Grapefruit.png",
      "traits": {
        "role": "Lead",
        "affection": "Cuddly",
        "mindset": "Realistic",
        "attitude": "Optimistic"
      },
      "personality": "깔끔하고 성숙한 분위기로 자연스럽게 동경을 받는 타입입니다. 머리 회전이 빠르고 처세술이 좋아 연장자에게도 사랑받습니다. 끈적임 없는 '마이페이스' 성향이지만, 그 속에 은근한 깊이가 있어 사람을 끄는 매력이 있습니다.",
      "style": "혼자서도 잘 지내는 타입이라 연애에 덤덤해 보일 수 있습니다. 표현이 과하지 않아 오해를 사기도 하지만, 행동으로 은은하게 진심을 전합니다. 평소엔 강한 멘탈을 보이다가 내 사람에게만 보여주는 약한 모습이 치명적인 매력입니다.",
      "ideal": "강아지처럼 다정하게 따르는 사람에게 마음이 약해지지만, 동시에 개인적인 공간과 거리감을 존중해 주는 관계를 선호합니다. 어른스러운 겉모습 뒤에 숨겨진 귀여움이나 어리광을 자연스럽게 받아주는 사람과 있을 때 편안함을 느낍니다.",
      "best": "청견 - 강아지 같은 청견에게 마음을 열게 되며, 사랑스러운 상대를 보며 즐거워하는 최고의 균형입니다.",
      "good": "블러드 오렌지 - 서로 마이페이스라 싸움 없이 온화하게 잘 지내는, 이해하기 쉬운 관계입니다.\n\n감귤 - 감귤의 다정함이 당신에게는 장점이 되며, 당신의 덤덤함에 상대는 안심을 느낍니다.",
      "challenge": "자몽 - 너무 완벽해 보이지만 서로 마이페이스라 거리감이 좁혀지지 않습니다. 약점을 보여준다면 끌릴 수 있습니다."
    },
    "12": {
      "id": 12,
      "code": "1100",
      "name": "유자",
      "image": "@/assets/images/lovetype/Yuzu.png",
      "traits": {
        "role": "Lead",
        "affection": "Accept",
        "mindset": "Passionate",
        "attitude": "Earnest"
      },
      "personality": "부드러운 향기 속에 단단한 힘을 가진, 따뜻한 리더형입니다. 포용력이 넓어 어떤 위치에서든 제 몫을 해내며 인망이 두텁습니다. 다만 거절을 잘 못해 이용당할 수도 있으니 주의가 필요한, 진국인 사람입니다.",
      "style": "상대에게 도움이 되고 싶어 하며, 헌신적으로 돌보는 따뜻한 연애를 합니다. 이끌어주면서도 필요할 땐 맞춰주는 유연함을 겸비했습니다. 은은하게 오래가는 향기처럼 꾸준하고 안정적인 사랑을 줍니다.",
      "ideal": "자신이 지켜주고 싶거나, 자신을 절대적으로 필요로 하는 사람에게 끌리는 경향이 있습니다. 하지만 서로 존중하는 성숙한 연애도 훌륭하게 소화합니다. 누군가를 구원하는 힘이 있지만, 자신의 지친 마음도 알아주는 상대를 만나는 것이 중요합니다.",
      "best": "카라향 - 당신의 진가를 카라향이 알아봅니다. 당신의 성실함이 상대에게 긍정적인 영향을 줍니다.",
      "good": "유자 - 진정으로 마주할 수 있는 상대로, 존중과 신뢰가 가득한 균형 잡힌 커플이 됩니다.\n\n천혜향 - 천혜향에게 잘 맞춰주면서도 휘둘리지 않는 당신의 안정감이 상대에게 큰 기쁨이 됩니다.",
      "challenge": "라임 - 둘 다 상대를 잘 다루는 타입이라 나쁘진 않지만, 불꽃이 튀는 열정적인 관계는 되기 어렵습니다."
    },
    "13": {
      "id": 13,
      "code": "1101",
      "name": "진지향",
      "image": "@/assets/images/lovetype/Tsunokaori.png",
      "traits": {
        "role": "Lead",
        "affection": "Accept",
        "mindset": "Passionate",
        "attitude": "Optimistic"
      },
      "personality": "단정해 보이지만 예상치 못한 순간 강렬한 집중력을 발휘하는 반전 매력의 소유자입니다. 평소엔 편안하지만 위급할 땐 믿음직스럽게 변합니다. 종잡을 수 없는 기복이 있지만, 기본적으로 밝고 상쾌해 미움받지 않습니다.",
      "style": "헌신하다가도 갑자기 이별을 고하는 등 예측불허의 연애 패턴을 보입니다. 악의는 없으며 자신의 감정에 매우 솔직하기 때문입니다. 겉은 산뜻하지만 속은 냉철하며, 연애를 통해 끊임없이 변화하는 타입입니다.",
      "ideal": "변화무쌍한 당신의 페이스를 이해하고 받아들여 주는 사람이 필요합니다. 겉으론 무심해 보여도 속으로는 상대의 애정 표현을 즐기므로, 다정하게 다가오는 사람과 잘 맞습니다. 서로의 변화를 즐길 수 있는 관계가 이상적입니다.",
      "best": "오렌지 - 알 수 없는 매력의 당신에게 오렌지가 반하며, 서로의 매력을 알아보면 불꽃이 튀는 궁합입니다.",
      "good": "감귤 - 당신의 다면적인 모습이 감귤에게 즐거운 자극이 되며, 독특한 페이스를 이해해 주는 관계입니다.\n\n진지향 - 설명하지 않아도 서로의 페이스를 이해하고 존중하며, 억지로 맞추지 않아도 편안합니다.",
      "challenge": "낑깡 - 성실한 낑깡에게 속을 알 수 없는 당신은 어렵고, 기가 세서 부딪히기 쉽습니다."
    },
    "14": {
      "id": 14,
      "code": "1110",
      "name": "황금향",
      "image": "@/assets/images/lovetype/Beni.png",
      "traits": {
        "role": "Lead",
        "affection": "Accept",
        "mindset": "Realistic",
        "attitude": "Earnest"
      },
      "personality": "타고난 카리스마와 안정감으로 자연스럽게 신뢰를 얻는 리더형입니다. 확고한 주관과 포용력을 겸비해 균형이 잡혀 있지만, 빈틈이 없어 보여 다가가기 힘들다는 인상을 주기도 합니다. 친해지면 깊은 정을 줍니다.",
      "style": "감정에 휘둘리지 않고 관계를 안정적으로 이끄는 능력이 탁월합니다. 실패 없는 연애를 하지만, 지나치게 신중해서 시작이 늦어지기도 합니다. 말보다는 행동으로, 은은하고 깊게 사랑을 표현하는 진국인 타입입니다.",
      "ideal": "자신의 기준에 부합하는 믿을 수 있는 사람을 신중하게 선택합니다. 외적인 조건보다 본질을 꿰뚫어 보기에, 어떤 유형이든 조율해 나갈 수 있습니다. 당신의 은은한 사랑의 깊이를 알아주는 사람과 오래갑니다.",
      "best": "레드향 - 레드향의 친화력을 당신이 받아주며, 비슷한 가치관으로 평온한 관계를 유지합니다.",
      "good": "포멜로 - 포멜로의 서툰 면을 모두 이해해 줍니다. 비슷하면서도 신비로운 서로의 매력에 끌립니다.\n\n오렌지 - 오렌지의 자유로움을 당신이 관용으로 받아주어 완벽한 균형을 이룹니다.",
      "challenge": "한라봉 - 둘 다 너무 신중하고 독립적이라 관계가 시작조차 되기 어렵습니다. 만난다면 독립적인 관계가 됩니다."
    },
    "15": {
      "id": 15,
      "code": "1111",
      "name": "레몬",
      "image": "@/assets/images/lovetype/Lemon.png",
      "traits": {
        "role": "Lead",
        "affection": "Accept",
        "mindset": "Realistic",
        "attitude": "Optimistic"
      },
      "personality": "어디서나 또렷한 색깔과 존재감을 드러냅니다. 자기주장이 확실하고 시원시원하며, 겉으로는 당당해 보이지만 속에는 섬세한 감정을 감추고 있습니다. 시간이 지날수록 진가가 드러나는 볼수록 매력적인 사람입니다.",
      "style": "상대를 휘두르려 하지 않아도 자연스레 관계를 주도하게 됩니다. 자유분방함과 단단한 중심을 동시에 지녀 상대를 매료시킵니다. 쉽지 않아 보이지만 한 번 마음을 열면 예상치 못한 귀여움과 반전 매력을 보여줍니다.",
      "ideal": "자유롭고 독립적인 성향을 이해하고, 묵묵히 곁을 지켜주는 넓은 마음을 가진 사람이 이상적입니다. 당신의 마음을 서두르지 않고 기다려주는 사람에게 깊은 신뢰와 흔들림 없는 사랑을 줍니다.",
      "best": "감귤 - 당신이 이끌고 감귤이 지지하는, 서로의 부족함을 완벽히 채워주는 최고의 커플입니다.",
      "good": "레드향 - 당신의 에너지에 레드향이 끌리며, 당신의 침착함을 상대가 이해해주어 적절한 온도의 관계가 됩니다.\n\n청견 - 활발한 에너지가 잘 맞습니다. 당신의 페이스를 따르는 청견에게 매력을 느낍니다.",
      "challenge": "레몬 - 자존심이 강해 양보가 없습니다. 잘 맞으면 화려하지만 아니면 극적으로 충돌하는 스릴 넘치는 관계입니다."
    }
  }